application/app/controllers/events_controller.rb

  def index
    @events = Event.search(params[:name]).page(params[:page]).per(10)
---
SELECT  "events".* FROM "events" WHERE (upper(name) ilike '%%') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events" WHERE (upper(name) ilike '%%')